I've just upgraded from 0.30.1 to 0.30.2 and I'm still seeing the issue when trying to upload an ISO to Proxmox 8.0.4

Code:
```
resource "proxmox_virtual_environment_file" "talos_iso" {
  datastore_id = var.shared_storage_name
  content_type = "iso"
  node_name = var.controllers[0].node
  source_file {
    path = "https://github.com/siderolabs/talos/releases/download/${var.talos_version}/metal-amd64.iso"
    file_name = "metal-amd64-${var.talos_version}.iso"
  }
}
```

Init output:
```
Initializing the backend...

Initializing provider plugins...
- Finding bpg/proxmox versions matching "0.30.2"...
- Finding hashicorp/vault versions matching "3.20.0"...
- Using previously-installed bpg/proxmox v0.30.2
- Using previously-installed hashicorp/vault v3.20.0
```

Plan output:
```
  # proxmox_virtual_environment_file.talos_iso will be created
  + resource "proxmox_virtual_environment_file" "talos_iso" {
      + content_type           = "iso"
      + datastore_id           = "nas_raid5_nfs"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "beelink"
      + timeout_upload         = 1800

      + source_file {
          + changed   = false
          + file_name = "metal-amd64-v1.5.1.iso"
          + insecure  = false
          + path      = "https://github.com/siderolabs/talos/releases/download/v1.5.1/metal-amd64.iso"
        }
    }
```

Result
```
Error: error uploading file to datastore nas_raid5_nfs: failed waiting for upload - error retrieving task status: received an HTTP 400 response - Reason: Parameter verification failed. (upid: no such task)
```